Autodesk.Revit.DB.Structure.AnalyzeAs
Analyze As has various functions within the Analytical Model, and is Element-dependent.
"Not for Analysis" usually means that there will not be an Analytical Model generated.
The others indicate how the Analytical Model behavior will treat the Element in question.
For instance "Hanger" columns have different support expectations than "Gravity" columns.

Autodesk.Revit.DB.Structure.AnalyzeAs.GravityLateral
Wall interpreted as Gravity and Lateral

Autodesk.Revit.DB.Structure.AnalyzeAs.SlabTwoWay
Floor interpreted as Slab Two-Way.

Autodesk.Revit.DB.Structure.AnalyzeAs.NotApplicable
Analyze As is not applicable.

Autodesk.Revit.DB.Structure.AnalyzeAs.NotForAnalysis
Element is not for Analysis.

Autodesk.Revit.DB.Structure.AnalyzeAs.SlabOnGrade
Floor interpreted as Slab on a Grade.

Autodesk.Revit.DB.Structure.AnalyzeAs.Mat
Floor interpreted as Mat Foundation, or general foundation.

Autodesk.Revit.DB.Structure.AnalyzeAs.SlabOneWay
Floor interpreted as Slab One-Way.

Autodesk.Revit.DB.Structure.AnalyzeAs.Lateral
Interpreted as Lateral (support going across).

Autodesk.Revit.DB.Structure.AnalyzeAs.Gravity
Interpreted as Gravity (support going down).

Autodesk.Revit.DB.Structure.AnalyzeAs.Hanger
A hanging Element.